In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("exams.csv")

In [3]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group D,some college,standard,completed,59,70,78
1,male,group D,associate's degree,standard,none,96,93,87
2,female,group D,some college,free/reduced,none,57,76,77
3,male,group B,some college,free/reduced,none,70,70,63
4,female,group D,associate's degree,standard,none,83,85,86

Transformando as colunas em algo mais f√°cil de trabalhar

In [4]:
df.columns = ["genero", "etinia", "educacao_parental", "almoco", "curso_preparatorio", "nota_mat", "nota_leitura", "nota_escrita"]

In [5]:
df.head()

,genero,etinia,educacao_parental,almoco,curso_preparatorio,nota_mat,nota_leitura,nota_escrita
0,female,group D,some college,standard,completed,59,70,78
1,male,group D,associate's degree,standard,none,96,93,87
2,female,group D,some college,free/reduced,none,57,76,77
3,male,group B,some college,free/reduced,none,70,70,63
4,female,group D,associate's degree,standard,none,83,85,86

In [12]:
df.drop("almoco", axis=1, inplace = True)

In [13]:
df.head(5)

,genero,etinia,educacao_parental,curso_preparatorio,nota_mat,nota_leitura,nota_escrita
0,female,group D,some college,completed,59,70,78
1,male,group D,associate's degree,none,96,93,87
2,female,group D,some college,none,57,76,77
3,male,group B,some college,none,70,70,63
4,female,group D,associate's degree,none,83,85,86

In [52]:
var = list(map(lambda x: x.replace("completed", "1") if x == "completed" else x.replace("none", "0"), df["curso_preparatorio"]))

In [53]:
df["curso_preparatorio"] = var

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   genero              1000 non-null   object
 1   etinia              1000 non-null   object
 2   educacao_parental   1000 non-null   object
 3   curso_preparatorio  1000 non-null   object
 4   nota_mat            1000 non-null   int64
 5   nota_leitura        1000 non-null   int64
 6   nota_escrita        1000 non-null   int64
dtypes: int64(3), object(4)
memory usage: 54.8+ KB

In [60]:
 df["curso_preparatorio"] = df["curso_preparatorio"].astype(int)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   genero              1000 non-null   object
 1   etinia              1000 non-null   object
 2   educacao_parental   1000 non-null   object
 3   curso_preparatorio  1000 non-null   int32
 4   nota_mat            1000 non-null   int64
 5   nota_leitura        1000 non-null   int64
 6   nota_escrita        1000 non-null   int64
dtypes: int32(1), int64(3), object(3)
memory usage: 50.9+ KB

In [64]:
df.head(6)

,genero,etinia,educacao_parental,curso_preparatorio,nota_mat,nota_leitura,nota_escrita
0,female,group D,some college,1,59,70,78
1,male,group D,associate's degree,0,96,93,87
2,female,group D,some college,0,57,76,77
3,male,group B,some college,0,70,70,63
4,female,group D,associate's degree,0,83,85,86
5,male,group C,some high school,0,68,57,54

In [68]:
df["educacao_parental"].value_counts()

some college          224
high school           215
associate's degree    204
some high school      177
bachelor's degree     105
master's degree        75
Name: educacao_parental, dtype: int64

In [85]:
df[df["nota_mat"] > 70 ][["educacao_parental", "curso_preparatorio" ,"genero"]][]

      educacao_parental  curso_preparatorio  genero
1    associate's degree                   0    male
4    associate's degree                   0  female
6    associate's degree                   0  female
8      some high school                   0    male
10     some high school                   0    male
..                  ...                 ...     ...
993    some high school                   0    male
994  associate's degree                   0  female
995        some college                   0    male
996        some college                   0    male
998         high school                   0    male

[441 rows x 3 columns]

In [81]:
df[df["educacao_parental"] == "bachelor's degree"][["nota_mat", "nota_leitura", "nota_escrita"]].describe()

         nota_mat  nota_leitura  nota_escrita
count  105.000000    105.000000    105.000000
mean    69.866667     71.819048     72.266667
std     14.262017     14.238208     15.560840
min     39.000000     35.000000     36.000000
25%     61.000000     62.000000     62.000000
50%     68.000000     71.000000     72.000000
75%     81.000000     82.000000     82.000000
max    100.000000    100.000000    100.000000